Title: Working with Strings
Slug: sql/working-with-strings
Category: SQL
Tags: SELECT, FROM, JOIN, LIMIT, ||, upper, lower, substring, left, right
Date: 2017-08-27
Modified: 2017-08-27

#### Load ipython-sql extension

In [1]:
# The 2 lines below prevent an error message from being displayed when we run %load_ext sql
import warnings
warnings.filterwarnings('ignore')

%load_ext sql
%config SqlMagic.feedback = False

#### Connect to the database

In [2]:
%%sql

postgresql://localhost/dvdrental

'Connected: None@dvdrental'

#### Manipulating strings
**`||`**: Concatenate two or more strings together

**`upper`**: Convert to uppercase

**`lower`**: Convert to lowercase

In [15]:
%%sql

SELECT
    ci.city
    , ci.city || ', ' || co.country as concatenated
    , upper(ci.city)
    , lower(ci.city)
FROM
    city ci
    JOIN country co on co.country_id = ci.country_id
LIMIT
    5

[('Kabul', 'Kabul, Afghanistan', 'KABUL', 'kabul'),
 ('Batna', 'Batna, Algeria', 'BATNA', 'batna'),
 ('Bchar', 'Bchar, Algeria', 'BCHAR', 'bchar'),
 ('Skikda', 'Skikda, Algeria', 'SKIKDA', 'skikda'),
 ('Tafuna', 'Tafuna, American Samoa', 'TAFUNA', 'tafuna')]

#### Substrings
**`substring`**: Return a substring based on an index (starting from 1) or a regular expression

**`left`**: Return first $n$ characters

**`right`**: Return last $n$ characters

`left` and `right` can also take negative indexes to trim characters from the opposite end of the string.

In [52]:
%%sql

SELECT
    ci.city
    , substring(ci.city from 1 for 2)
    , substring(ci.city from 3)
    , left(ci.city, 2)
    , right(ci.city, 3)
    , left(ci.city, -3) AS left_neg
    , right(ci.city, -2) AS right_pos
FROM
    city ci
    JOIN country co on co.country_id = ci.country_id
LIMIT
    5

[('Kabul', 'Ka', 'bul', 'Ka', 'bul', 'Ka', 'bul'),
 ('Batna', 'Ba', 'tna', 'Ba', 'tna', 'Ba', 'tna'),
 ('Bchar', 'Bc', 'har', 'Bc', 'har', 'Bc', 'har'),
 ('Skikda', 'Sk', 'ikda', 'Sk', 'kda', 'Ski', 'ikda'),
 ('Tafuna', 'Ta', 'funa', 'Ta', 'una', 'Taf', 'funa')]

This is just a selection of the string methods available in Postgres. For more examples, [see the docs](https://www.postgresql.org/docs/current/static/functions-string.html).